USE master
GO

CREATE DATABASE Lib ON  PRIMARY 
( NAME = N'Lib',		FILENAME = N'd:\MSSQL\Data\Lib.mdf'		 )		 
LOG ON 
( NAME = N'Lib_log', FILENAME = N'd:\MSSQL\Data\Lib_log.ldf' )
GO

USE Lib

CREATE TABLE Class(
	ID tinyint IDENTITY(1,1) NOT NULL,
	name varchar(5),
    CONSTRAINT PK_Class PRIMARY KEY (ID),
    CONSTRAINT Unique_Class UNIQUE (name)    
    )
GO
CREATE TABLE Student(
	ID tinyint IDENTITY(1,1) NOT NULL,
	name varchar(50),
	sex char(1),
	ID_Class tinyint,
    CONSTRAINT PK_ID_Student PRIMARY KEY(ID),  
    CONSTRAINT FK_Student_Class FOREIGN KEY (ID_class)
				REFERENCES Class (ID)
    )
    
GO
CREATE TABLE Reader(
	ID tinyint IDENTITY(1,1) NOT NULL, 
	ID_Student tinyint, 
    CONSTRAINT PK_Reader_ID PRIMARY KEY(ID), 
    CONSTRAINT FK_Reader_ID_Student FOREIGN KEY (ID_Student)
				REFERENCES Student (ID),
	CONSTRAINT Unique_ID_Student UNIQUE (ID_Student) 
    )
    
CREATE TABLE Autor(
	ID tinyint IDENTITY(1,1) NOT NULL,
	name varchar(50),
    CONSTRAINT PK_Autor PRIMARY KEY (ID),  
    )
GO
CREATE TABLE Book(
	ID tinyint IDENTITY(1,1) NOT NULL,
	ID_Author tinyint,
	name varchar(200), 
	year_book int,
    CONSTRAINT PK_Book_ID PRIMARY KEY(ID),  
    CONSTRAINT FK_Book_ID_Author FOREIGN KEY (ID_Author)
				REFERENCES Autor (ID)
    )
    
GO
CREATE TABLE Librarian(
	ID int IDENTITY(1,1) NOT NULL,
	name varchar(50),
	birth date,
    sex char(1),
    librarian_password varchar(50),
    CONSTRAINT PK_Librarian PRIMARY KEY (ID),  
    )
GO
CREATE TABLE Book_status(
	ID int IDENTITY(1,1) NOT NULL,
	ID_book tinyint,
	ID_reader tinyint NULL,
	Took date NULL,
    CONSTRAINT FK_Book_status_ID_book FOREIGN KEY (ID_Book)
				REFERENCES Book(ID),
    CONSTRAINT FK_Book_status_ID_reader FOREIGN KEY (ID_reader)
				REFERENCES Reader (ID),
    )
GO
INSERT INTO Class 
     VALUES
           ('1А'),
           ('2А'),
           ('3А'),
           ('4А'),
           ('5А'),
           ('6А'),
           ('7А'),
           ('8А'),
           ('9А'),
           ('10А'),
           ('11А'),
           ('11Б')
GO
INSERT INTO Student 
     VALUES
     ('Шишканов Фома Филиппович', 'м', 1),
     ('Борков Рюрик Потапович', 'м', 1),
     ('Рябкина Христина Кузьмевна', 'ж', 1),
     ('Онипченко Ефрем Проклович', 'м', 1),
     ('Аленина Ева Федоровна', 'ж', 1),
     ('Калагин Семен Куприянович', 'м', 1),
     ('Саврасов Эмиль Сергеевич', 'ж', 1),
     ('Базарова Кристина Александровна', 'ж', 1),
     ('Яковцова Кира Иосифовна', 'ж', 1),
     ('Кузаева Влада Якововна', 'ж', 1),
     ('Гришкина Майя Константиновна', 'ж', 2),
     ('Справцева Диана Вячеславовна', 'ж', 2),
     ('Муханова Лиана Елисеевна', 'ж', 2),
     ('Ермакова Тамара Захаровна', 'ж', 2),
     ('Моргунов Всеслав Мартьянович', 'м', 2),
     ('Лескова Ольга Германовна', 'ж', 2),
     ('Сенотрусова Екатерина Николаевна', 'ж', 2),
     ('Щеголяев Василий Самсонович', 'м', 2),
     ('Коломийцева Лилия Ипполитовна', 'ж', 2),
     ('Валиева Лидия Ростиславовна', 'ж', 2),
     ('Доронина Антонина Святославовна', 'ж', 3),
     ('Юхтрица Аза Владиленовна', 'ж', 3),
     ('Белочкин Модест Ерофеевич', 'м', 3),
     ('Потрепалов Денис Всеволодович', 'м', 3),
     ('Чибисова Агния Андрияновна', 'ж', 3),
     ('Яхонтов Богдан Эмилевич', 'м', 3),
     ('Коптильников Мартын Маркович', 'м', 3),
     ('Бебчук Михаил Михаилович', 'м', 3),
     ('Клименко Римма Юлиевна', 'ж', 3),
     ('Трындин Богдан Миронович', 'м', 3),
     ('Карамышев Ираклий Давыдович', 'м', 4),
     ('Логвинова Изольда Казимировна', 'ж', 4),
     ('Игнатенко Всеслава Федоровна', 'ж', 4),
     ('Витаева Таисия Константиновна', 'ж', 4),
     ('Кобзев Прохор Игнатиевич', 'м', 4),
     ('Тюлепова Дарья Никитевна ', 'ж', 4),
     ('Ярославов Агап Зиновиевич ', 'м', 4),
     ('Козариса Диана Анатолиевна', 'ж', 4),
     ('Расторгуев Денис Вячеславович', 'м', 4),
     ('Циммерман Игнатий Владимирович', 'м', 4),
     ('Яцкевича Милена Анатолиевна', 'ж', 5),
     ('Досаев Лев Андроникович', 'м', 5),
     ('Масмех Андрон Александрович', 'м', 5),
     ('Позона Жанна Мироновна', 'ж', 5),
     ('Соловьёв Владимир Макарович', 'м', 5),
     ('Зайцев Агафон Эрнстович', 'м', 5),
     ('Лапухова Светлана Игоревна', 'ж', 5),
     ('Харзин Мартын Михеевич', 'м', 5),
     ('Пайков Алексей Серафимович', 'м', 5),
     ('Осинцев Ярослав Евграфович', 'м', 5),
     ('Глускин Захар Епифанович', 'м', 6),
     ('Портнова Злата Геннадиевна', 'м', 6),
     ('Михалёв Артём Давыдович', 'м', 6),
     ('Гречко Эльвира Степановна', 'м', 6),
     ('Яньков Якуб Евстафиевич', 'м', 6),
     ('Бильбасова Злата Захаровна', 'ж', 6),
     ('Басманова Мирослава Иосифовна ', 'ж', 6),
     ('Квасов Максимильян Владиславович', 'м', 6),
     ('Чикунов Архип Аполлинариевич', 'м', 6),
     ('Мишутин Константин Эдуардович', 'м', 6),
     ('Шайнюк Евдоким Чеславович', 'м', 7),
     ('Берестова Арина Георгиевна', 'ж', 7),
     ('Язина Берта Трофимовна', 'ж', 7),
     ('Захарьин Мартын Андреевич', 'м', 7),
     ('Жирова Эмилия Емельяновна', 'ж', 7),
     ('Дёгтин Семён Андреевич', 'м', 7),
     ('Мышелова Валентина Трофимовна', 'ж', 7),
     ('Безродный Фаина Михеевна', 'ж', 7),
     ('Якуничев Остап Ростиславович', 'м', 7),
     ('Дежнёв Михаил Давыдович', 'м', 7),
     ('Федорова Маргарита Иосифовна', 'ж', 8),
     ('Поздняков Лавр Тарасович', 'м', 8),
     ('Званцова Ярослава Владленовна', 'ж', 8),
     ('Грачёва Регина Николаевна', 'ж', 8),
     ('Остальцев Изяслав Ерофеевич', 'м', 8),
     ('Шульгин Егор Глебович', 'м', 8),
     ('Козырева Инга Иларионовна', 'ж', 8),
     ('Махмудова Эмилия Игнатиевна', 'ж', 8),
     ('Эссен Захар Андриянович', 'м', 8),
     ('Худяков Парфен Олегович', 'м', 8),
     ('Погребной Савелий Ерофеевич', 'м', 9),
     ('Павлова Анастасия Петровна', 'ж', 9),
     ('Бурый Мирослав Остапович', 'м', 9),
     ('Чичваркина Антонина Захаровна', 'ж', 9),
     ('Вихорев Виссарион Агапович', 'м', 9),
     ('Лялюшкина Зинаида Емельяновна', 'ж', 9),
     ('Будникова Татьяна Юлиевна', 'ж', 9),
     ('Мащенко Елизавета Леонидовна', 'ж', 9),
     ('Кудашова Анна Серафимовна', 'м', 9),
     ('Анисимов Кир Панкратиевич', 'м', 9),
     ('Халипов Тихон Артемиевич', 'ж', 10),
     ('Каменева Анастасия Трофимовна', 'ж', 10),
     ('Серыха Марианна Ростиславовна', 'ж', 10),
     ('Няшина Милена Владиленовна', 'ж', 10),
     ('Горюнов Александр Онуфриевич', 'м', 10),
     ('Дмитриева Каролина Марковна', 'ж', 10),
     ('Счастливцева Бронислава Никитевна ', 'ж', 10),
     ('Ильюшина Елизавета Ильевна', 'ж', 10),
     ('Фомичёв Руслан Федотович ', 'м', 10),
     ('Свечин Аким Ипполитович', 'м', 10),
     ('Шамякина Кира Трофимовна', 'ж', 11),
     ('Снытко Валерия Елизаровна', 'ж', 11),
     ('Арсеньева Диана Елисеевна', 'ж', 11),
     ('Курзыбов Ян Леонтиевич', 'м', 11),
     ('Квитко Софья Трофимовна', 'ж', 11),
     ('Матизов Варфоломей Несторович', 'м', 11),
     ('Конно Ирина Яновна', 'ж', 11),
     ('Коллерова Эмма Карповна', 'ж', 11),
     ('Кувардина Милена Семеновна', 'ж', 11),
     ('Исмайлова Дарья Тимуровна', 'ж', 11)
GO  
INSERT INTO Reader
     VALUES
     (1),
     (3),
     (26),
     (27),
     (31),
     (32),
     (41),
     (47),
     (58),
     (59),
     (65),
     (67),
     (71),
     (80),
     (81),
     (89),
     (91),
     (92),
     (93),
     (101),
     (102),
     (104),
     (106),
     (107),
     (109)
 
GO
 INSERT INTO Librarian
		VALUES 
		('Бандуркина Валерия Давидовна', '1980-09-25', 'ж', 'aldhfvbalsvbsh1'),
		('Дубровский Анатолий Изяславович', '1970-04-14', 'м', 'skdfvbd1lhsdb')
 
GO   
  INSERT INTO Autor
		VALUES 
		('Пушкин Александр Сергеевич'),
		('Толстой Лев Николаевич'),
		('Горький Максим'),
		('Антон Павлович Чехов'),
		('Толстой Алексей Николаевич'),
		('Гоголь Николай Васильевич'),
		('Тургенев Иван Сергеевич'),
		('Лермонтов Михаил Юрьевич'),
		('Достоевский Фёдор Михайлович'),
		('Куприн Александр Иванович'),
		('Некрасов Николай Алексеевич'),
		('Бунин Иван Алексеевич'),
		('Маяковский Владимир Владимирович'),
		('Мамин-Сибиряк Дмитрий Наркисович'),
		('Короленко Владимир Галактинович'),
		('Блок Александр Александрович'),
		('Лесков Николай Семенович'),
		('Александр Николайвич Островский'),
		('Брюсов Валерий Яковлевич'),
		('Пастернак Борис Леонидович'),
		('Есенин Сергей Александрович'),
		('Тютчев Фёдор Иванович'),
		('Фет Афанасий Афанасьевич'),
		('Гончаров Иван Александрович'),
		('Грибоедов Александр Сергеевич')
 
GO 
INSERT INTO Book
	VALUES
		(1, 'Евгений Онегин', 1883),
		(2, 'Война и мир', 1865),
		(3, 'Дачники', 1902),
		(4, 'Переполох', 1886),
		(5, 'Детство Никиты', 1922),
		(6, 'Мертвые души', 1841),
		(7, 'Отцы и дети',1860),
		(8, 'Герой нашего времени', 1839),
		(9, 'Преступление и наказание', 1866),
		(10, 'Гранатовый браслет', 1910),
		(11, 'Русские женщины', 1872),
		(12, 'Чистый понедельник', 1944),
		(13, 'Облако в штанах', 1893),
		(14, 'Аленушкины сказки', 1897),
		(15, 'Полное посмертное собрание сочинений В. Г. Короленко', 1923),
		(16, 'Стихи о прекрасной даме',1902),
		(17, 'Повести и рассказы', 1955),
		(18, 'Гроза',1859),
		(19, 'Это - я',1896),
		(20, 'На ранних поездах', 1943),
		(21, 'Персидские мотивы', 1925),
		(22, 'Стихотворения Тютчева', 1868),
		(23, 'Весенний дождь',1859),
		(24, 'Мильон терзаний',1872),
		(25, 'Горе от ума', 1822)
  
GO
    INSERT INTO Book_status
		VALUES
		(1, null, null),
		(2, null, null),
		(3, null, null),
		(4, null, null),
		(5, null, null),
		(6, null, null ),
		(7, null, null),
		(8, null, null),
		(9, null, null),
		(10, null, null),
		(11, null, null),
		(12, null, null),
		(13, null, null),
		(14, null, null),
		(15, 1, '2020-03-18'),
		(17, 2, '2020-03-11' ),
		(18, 3, '2020-02-11'),
		(19, 8, '2020-02-15'),
		(20, 11, '2020-02-14'),
		(21, 14, '2020-04-9'),
		(22, 16, '2020-03-17'),
		(23, 9, '2020-01-18'),
		(24, 10, '2020-02-18')
		
GO
CREATE VIEW Книги AS
SELECT     dbo.Book_status.Took AS [Дата взятия], dbo.Book_status.ID_book, dbo.Book_status.ID_reader, dbo.Book.name + ',  ' + CAST(dbo.Book.year_book AS varchar) 
                      + ', ' + dbo.Autor.name AS Книга
FROM         dbo.Book_status INNER JOIN
                      dbo.Book ON dbo.Book_status.ID_book = dbo.Book.ID INNER JOIN
                      dbo.Autor ON dbo.Book.ID_Author = dbo.Autor.ID
--WHERE     (dbo.Book_status.ID_reader IS NULL) AND (dbo.Book_status.Took IS NULL)
GO
--WHERE     (dbo.Book_status.ID_reader IS NOT NULL) AND (dbo.Book_status.Took IS NOT NULL)
GO
CREATE VIEW Читатели AS
SELECT        Reader.ID, Student.name
FROM            Reader INNER JOIN
                         Student ON Reader.ID_Student = Student.ID
GO
CREATE VIEW Список AS
SELECT     dbo.Book_status.ID AS [№], dbo.Class.name AS Класс, dbo.Student.name AS [ФИО читателя], dbo.Book.name AS [Название книги], 
                      dbo.Autor.name AS [ФИО автора], dbo.Book.year_book AS [Год книги]
FROM         dbo.Book_status INNER JOIN
                      dbo.Book ON dbo.Book_status.ID_book = dbo.Book.ID INNER JOIN
                      dbo.Autor ON dbo.Book.ID_Author = dbo.Autor.ID INNER JOIN
                      dbo.Reader ON dbo.Book_status.ID_reader = dbo.Reader.ID INNER JOIN
                      dbo.Student ON dbo.Reader.ID_Student = dbo.Student.ID INNER JOIN
                      dbo.Class ON dbo.Student.ID_Class = dbo.Class.ID
GO